adinstruments/LightningDeviceSDK/examples/firmware/SAMD51Lightning/SAMD51Lightning.ino
#include "src/Adafruit_ZeroTimer.h"

/* N.B. to upload this firmware to the SAMD51 first double click the board's reset button
   to put it into boot loader mode. Then set the Arduino IDE port to the correct (boot loader)
   port.
*/

#define PHASE_LOCK_TO_USB_SOF 1
//#define TIMER_OUTPUT_FOR_TEST 1
//#define OUTPUT_USB_SOF_PLL_SIGNALS 1
//#define ENABLE_DCO_TEST_COMMANDS 1

Adafruit_ZeroTimer adcTimer(4);

#ifdef TIMER_OUTPUT_FOR_TEST
Adafruit_ZeroTimer zt3(3, GCLK_PCHCTRL_GEN_GCLK2_Val); //Testing with GCLK2 set to 48MHz not 100 MHz
#endif

/* Valid PWM outs (for Adafruit Feather ):

FOR SAMD21:
  Timer3: channel 0 on D2 or D10, channel 1 on D5 or D12
  Timer4: channel 0 on SDA or A1, channel 2 on SCL or A2
  Timer5: channel 0 on MOSI, channel 1 on SCK

FOR SAMD51:
  Timer3: channel 0 on D10 or MISO, channel 1 on D11
  Timer4: channel 0 on A4, D7, or D1, channel 2 on A5, D4, or D0
  Timer5: channel 0 on D5, channel 1 on D6
*/

#if defined(__SAMD51__)
#define TIMER3_OUT0 10
#define TIMER3_OUT1 11

#define TIMER4_OUT0 A4
#define TIMER4_OUT1 A5

#define TIMER5_OUT1 6
#else
#define TIMER3_OUT0 10
#define TIMER3_OUT1 12

#define TIMER4_OUT0 A1
#define TIMER4_OUT1 A2

#define TIMER5_OUT1 SCK
#endif

//#define ENABLE_ADCTIMER_PWMOUT 1
//#define TIMING_CHECK 1
const char *kSerialNumber = "0001";

const char *kFWVersion = "0.9.1";

enum ADIDeviceSynchModes
{
   kDeviceSynchNone = 0 | 0,
   kDeviceSyncRoundTrip = 1 | 0,
   kDeviceSyncUSBFrameTimes = 2 | 0,
   kDeviceSynchUSBLocked = 4 | 0,
   kDeviceSynchUSBStartOnSpecifiedFrame = 8 | 0,
   kDeviceSynchUSBFrametimeSuppport = kDeviceSyncRoundTrip | kDeviceSyncUSBFrameTimes,
   kDeviceSynchUSBFullSuppport = kDeviceSyncRoundTrip | kDeviceSyncUSBFrameTimes | kDeviceSynchUSBLocked | kDeviceSynchUSBStartOnSpecifiedFrame | 0,
};

#ifdef TIMING_CHECK
const int kDefaultADCPointsPerSec = 1; //1024;//100; //~5000 max with 2 samples (1 point) per packet
#else
const int kDefaultADCPointsPerSec = 100; //~5000 max with 2 samples (1 point) per packet
#endif

int gADCPointsPerSec = kDefaultADCPointsPerSec; //~5000 max with 2 samples (1 point) per packet

const int kSampleRates[] = {10000, 4000, 2000, 1000, 400, 200, 100};
const int kNSampleRates = sizeof(kSampleRates) / sizeof(int);

const int kADCStartChan = 2; //A1

#ifdef TIMING_CHECK
const int kADCChannels = 1; //2;
#else
const int kADCChannels = 2;
#endif

const int kADCEndChan = kADCStartChan + kADCChannels;

void debugNewLine()
{
   //Serial.write('\n'); //Readability while testing only!
}

inline uint32_t saveIRQState(void)
{
   uint32_t pmask = __get_PRIMASK() & 1;
   __set_PRIMASK(1);
   return pmask;
}

inline void restoreIRQState(uint32_t pmask)
{
   __set_PRIMASK(pmask);
}

inline void syncADC0_ENABLE()
{
   while (ADC0->SYNCBUSY.reg & ADC_SYNCBUSY_ENABLE)
      ;
}

inline void syncADC0_CTRLB()
{
   while (ADC0->SYNCBUSY.reg & ADC_SYNCBUSY_CTRLB)
      ;
}

inline void syncADC0_SAMPCTRL()
{
   while (ADC0->SYNCBUSY.reg & ADC_SYNCBUSY_SAMPCTRL)
      ;
}

inline void syncADC0_INPUTCTRL()
{
   while (ADC0->SYNCBUSY.reg & ADC_SYNCBUSY_INPUTCTRL)
      ;
}

inline void syncADC0_SWTRIG()
{
   while (ADC0->SYNCBUSY.reg & ADC_SYNCBUSY_SWTRIG)
      ;
}

void startADCTimer(uint32_t frequency)
{
   /********************* Timer #4 + #5, 32 bit, one PWM out */
   adcTimer.configure(TC_CLOCK_PRESCALER_DIV1,      // prescaler
                      TC_COUNTER_SIZE_32BIT,        // bit width of timer/counter
                      TC_WAVE_GENERATION_MATCH_FREQ // frequency or PWM mode
   );
   //adcTimer.setPeriodMatch(1000, 200);      // channel 1 only, 200/1000 count
   //Adafruit timer routines set the timer source to GCLK1 (48 MHz)
   adcTimer.setCompare(0, VARIANT_GCLK1_FREQ / frequency - 1);
#ifdef ENABLE_ADCTIMER_PWMOUT
   //N.B. this will be at half the rate of the ADC (i.e. each edge triggers a set of conversions across channels)
   if (!adcTimer.PWMout(true, 0, TIMER4_OUT0))
   {
      Serial.println("Failed to configure PWM output");
   }
#endif

   TC4->COUNT32.EVCTRL.reg |= TC_EVCTRL_MCEO0;
   while (TC4->COUNT32.SYNCBUSY.reg > 0)
      ; // Wait for synchronization

   //Setup event system so TC4 triggers ADC conversion start
   MCLK->APBBMASK.reg |= MCLK_APBBMASK_EVSYS;

   // Select the event system user on channel 0 (USER number = channel number + 1)
   EVSYS->USER[EVSYS_ID_USER_ADC0_START].reg = EVSYS_USER_CHANNEL(1); // Set the event user (receiver) as timer TC0

   EVSYS->Channel[0].CHANNEL.reg = EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT |         // No event edge detection
                                   EVSYS_CHANNEL_PATH_ASYNCHRONOUS |            // Set event path as asynchronous
                                   EVSYS_CHANNEL_EVGEN(EVSYS_ID_GEN_TC4_MCX_0); // Set event generator (sender) as TC4 Match/Capture 0

   //Now do this in USBHandlerHook() so sampling starts on a USB Frame
   //adcTimer.enable(true);
}

void adc_setup()
{
   //Setup ADC

   analogReadResolution(12);
   analogReference(AR_DEFAULT);

   pinPeripheral(A1, PIO_ANALOG);
   pinPeripheral(A2, PIO_ANALOG);

   ADC0->INPUTCTRL.bit.MUXPOS = kADCStartChan;
   syncADC0_INPUTCTRL();

   //PM->APBCMASK.reg |= PM_APBCMASK_ADC; already done by wiring.c

   ADC0->EVCTRL.reg = ADC_EVCTRL_STARTEI; //Start on event

   ADC0->INTENSET.reg = ADC_INTENSET_RESRDY; //Enable interrupt on result ready

   ADC0->CTRLA.bit.ENABLE = 1; // Enable ADC
   syncADC0_ENABLE();

   //NVIC_SetPriority(ADC_IRQn, 0);    // Set the Nested Vector Interrupt Controller (NVIC) priority for ADC to 0 (highest)

   NVIC_EnableIRQ(ADC0_1_IRQn);
}

template <class T, int Size>
class RingBufferSized
{
public:
   typedef int TIndex;

   RingBufferSized() : mIn(0), mOut(0)
   {
   }

   void Clear()
   {
      mOut = mIn;
   }

   TIndex GetCount() const
   {
      TIndex result = mIn - mOut;
      if (result < 0)
         result += Size;
      return result;
   }

   TIndex GetSpace() const
   {
      return (Size - 1) - GetCount();
   }

   bool Push(T val)
   {
      if (GetSpace())
      {
         mBuffer[mIn++] = val;
         if (mIn >= Size)
            mIn -= Size;
         return true;
      }
      return false;
   }

