adinstruments/LightningDeviceSDK/examples/firmware/SAMD51Lightning/SAMD51Lightning.ino
   //Returns num pushed
   int Push(const T *val, TIndex nToPushIn)
   {
      TIndex nToPushRemain = nToPushIn;
      TIndex space = GetSpace();

      if (nToPushRemain > space)
         nToPushRemain = space; //limit to available space
      else
         space = nToPushIn; //space is now number that will be pushed

      if (nToPushRemain)
      {                                    //There is space
         TIndex lenToCopy1 = (Size - mIn); //space available before wrapping
         if (lenToCopy1 > nToPushRemain)
            lenToCopy1 = nToPushRemain;
         memcpy(mBuffer + mIn, val, lenToCopy1 * sizeof(T));
         mIn += lenToCopy1;
         if (mIn >= Size)
            mIn -= Size;
         nToPushRemain -= lenToCopy1;
         if (nToPushRemain)
         { //still some left to copy, wrap to start of buffer
            memcpy(mBuffer, val + lenToCopy1, nToPushRemain * sizeof(T));
            mIn += nToPushRemain;
            if (mIn >= Size)
               mIn -= Size;
         }
      }
      return space; //Space is number pushed.
   }

   bool Get(T *val) const
   {
      if (GetCount())
      {
         *val = mBuffer[mOut];
         return true;
      }
      return false;
   }

   const T &Get() const
   {
      return mBuffer[mOut];
   }

   const T &GetNext()
   {
      const T &result = mBuffer[mOut++];
      if (mOut >= Size)
         mOut -= Size;
      return result;
   }

   bool GetNext(T *val)
   {
      if (GetCount())
      {
         *val = mBuffer[mOut++];
         if (mOut >= Size)
            mOut -= Size;
         return true;
      }
      return false;
   }

   bool NextOut()
   {
      if (GetCount())
      {
         mOut++;
         if (mOut >= Size)
            mOut -= Size;
         return true;
      }
      return false;
   }

protected:
   T mBuffer[Size];
   volatile TIndex mIn;
   volatile TIndex mOut;
};

const int kMaxCommandLenBytes = 64;

const int kBytesPerSample = sizeof(int16_t);

const int kPointsPerPacket = 1;
const int kPointsPerMediumSizePacket = 10;

int gADCPointsPerPacket = kPointsPerPacket;

//Statically allocating individual buffers larger than this causes the firmware to crash for some reason
const int kTotalBufferSpaceBytes = kADCChannels < 2 ? 32000 : 64000;

const int kBufferPoints = kTotalBufferSpaceBytes / kBytesPerSample / kADCChannels;

typedef RingBufferSized<int16_t, kBufferPoints> TRingBuf;

TRingBuf gSampleBuffers[kADCChannels];

volatile int32_t gFirstADCPointus = 0;

enum State
{
   kIdle,
   kWaitingForUSBSOF,
   kStartingSampling,
   kHadFirstSample,
   kSampling,
};

volatile State gState = kIdle;
volatile bool gFirstSampleTimeRequested = false;

volatile bool gADCstate = false;

volatile int16_t gStartOnFrame = -1; //-1 means start on the next USB frame

/**
 * Measured one fine step (133 to 134) to give a frequency offset of 5 parts in 10000
 * with the SAMD51.
 * Measured one coarse step to equal 12 fine steps. It was intially 29 out of 64 steps total.
*/
#if defined(__SAMD51__)
const int kDFLLFineMax = 127;
const int kDFLLFineMin = -128;
#else
const int kDFLLFineMax = 511;
const int kDFLLFineMin = -512;
#endif

extern "C" void UDD_Handler(void);

const int32_t kUSBFramePeriodus = 1000;
const int kUSBFrameBits = 11; //USB frame count is 11 bits
const int32_t kUSBFrameCountMask = (1 << kUSBFrameBits) - 1;
const int32_t kUSBFrameMSBitMask = 1 << (kUSBFrameBits - 1);

volatile int16_t gLastFrameNumber = 0;
volatile int32_t gPrevFrameTick = -1;

volatile int gLastDCOControlVal = 0;

volatile bool gUSBBPinState = false;

const int kHighSpeedTimerTicksPerus = 4;
const int kHighSpeedTimerTicksPerUSBFrame = 1000 * kHighSpeedTimerTicksPerus;

const int kOneOverLeadGainus = 1; // 1/proportional gain

#if defined(__SAMD51__)
const int kOneOverLagGainus = 4096; // 1/integral gain
const int kOneOverClippedLeadGainus = 4;
#else
const int kOneOverLagGainus = 2048; // 1/integral gain
const int kOneOverClippedLeadGainus = 1;
#endif
const int kFixedPointScaling = kOneOverLagGainus * kHighSpeedTimerTicksPerus;

//1 us per ms is larger than any crystal error we should need to measure
const int kMaxRateErrorClipTicksPerms = 1 * kHighSpeedTimerTicksPerus;
const uint32_t kLockDetectAccumTCms = 256;
const int32_t kLockedPhaseLimit_us = 20;
const int32_t kLockedPhaseLimitTicks = kLockedPhaseLimit_us * kHighSpeedTimerTicksPerus;

volatile bool gUSBLocked = false;

//Integrator for integral feedback to remove DC error
volatile int32_t sPSDPhaseAccum = 0;

//First order LPF for lead (proportional) feedback
volatile int32_t gLeadPhaseAccum = 0;
const int kLeadPhaseTC = 16;

volatile int32_t gLastUSBSOFTimeus = 0;

void USBHandlerHook(void)
{
   if (USB->DEVICE.INTFLAG.bit.SOF) //Start of USB Frame interrupt
   {
      //Measure phase using Cortex cpu timer. Convert to 0.25 us ticks using a runtime multiply and compile time divides for speed.
      int32_t frameTick = ((SysTick->LOAD - SysTick->VAL) * (kHighSpeedTimerTicksPerus * 1024 * 1024 / (VARIANT_MCK / 1000000))) >> 20;
      //auto frame_us = frameTick / kHighSpeedTimerTicksPerus;

      int32_t newUSBSOFTimeus = micros();
      int16_t frameNumber = USB->DEVICE.FNUM.bit.FNUM;

      //In general, micros() is not reliable when called from within an Interrupt Service Routine
      //and it is difficult to implement reliably across platforms.
      //When the processor is locked to USB, the USB SOF interrupts are happening around the same
      //time as the 1 kHz system timer interrupts that increment millis.
      //As a result, the hardware timer part of micros() can wrap before the millis part has been
      //incremented.
      //The following lines check for this case and handle it in a processor independent way.
      int32_t lastUSBSOFTimeus = gLastUSBSOFTimeus;
      if (newUSBSOFTimeus - lastUSBSOFTimeus < kUSBFramePeriodus / 2)
      {
         newUSBSOFTimeus += kUSBFramePeriodus;
         //digitalWrite(LED_BUILTIN, LOW);
      }

      // auto frameDelta = frameNumber - gLastFrameNumber;
      // frameDelta &= kUSBFrameCountMask;
      // if(frameDelta & kUSBFrameMSBitMask)
      //    frameDelta |= ~kUSBFrameCountMask; //Sign extend

      // if(frameDelta != 1)
      //    digitalWrite(LED_BUILTIN, LOW);

