adinstruments/LightningDeviceSDK/examples/firmware/SAMD51Lightning/SAMD51Lightning.ino
      digitalWrite(1, gUSBBPinState = !gUSBBPinState);

      if (gState == kWaitingForUSBSOF)
      {
         if (gStartOnFrame == frameNumber || gStartOnFrame < 0)
         {
            adcTimer.enable(true);
            gState = kStartingSampling;
         }
      }
      //frameus in range [0, 1000)
      //usbd.frameNumber();

      //if(gPrevFrameTick >= 0)
      {
         static int32_t sLastPhase = 0;

         int phase = frameTick;
         //phase needs to be bipolar, so wrap values above kHighSpeedTimerTicksPerUSBFrame/2 to be -ve. We want to lock with frameHSTick near 0.
         if (phase >= kHighSpeedTimerTicksPerUSBFrame / 2)
            phase -= kHighSpeedTimerTicksPerUSBFrame;

         //If phase > 0 the USB frame was later than the SYSTICK wrap so we need to
         //slow down the system clock a little.

         //One-sided clip of phase to reduce effect of ISR latency spikes.
         // I.e. clip large +ve going deltas resulting from the ISR being delayed, causing phase
         // to be larger than it should be.
         int32_t deltaPhaseTicks = phase - sLastPhase;
         if (gUSBLocked && deltaPhaseTicks > kMaxRateErrorClipTicksPerms)
         {
            phase = sLastPhase + kMaxRateErrorClipTicksPerms;
            digitalWrite(LED_BUILTIN, LOW); //Diagnostic
         }

         sLastPhase = phase;

         //First order LPF for lead (proportional) feedback (LPF to reduce the effects of phase detector noise)
         gLeadPhaseAccum += phase;
         int leadPhase = gLeadPhaseAccum / kLeadPhaseTC;
         gLeadPhaseAccum -= leadPhase;

         //First order LPF for lock detect
         static uint32_t sLockDetectAccum = 0;

         sLockDetectAccum += abs(leadPhase);
         int32_t lockError = sLockDetectAccum / kLockDetectAccumTCms;

         sLockDetectAccum -= lockError;
         gUSBLocked = abs(lockError) < kLockedPhaseLimitTicks;

         //Unfiltered lead feedback clipped to +/- 1 to reduce the effects of phase detector noise without adding delay
         int signOfPhase = 0;
         if (phase > 0)
            signOfPhase = 1;
         else if (phase < 0)
            signOfPhase = -1;

         //Calculate the filtered error signal
         int32_t filterOut = (signOfPhase * kFixedPointScaling / kOneOverClippedLeadGainus +
                              leadPhase * kFixedPointScaling / (kOneOverLeadGainus * kHighSpeedTimerTicksPerus) +
                              sPSDPhaseAccum) /
                             kFixedPointScaling;
         sPSDPhaseAccum += phase; //integrate the phase to get lag (integral, 2nd order) feedback

         //Clip to limits of DCO
         if (filterOut > kDFLLFineMax)
            filterOut = kDFLLFineMax;
         else if (filterOut < kDFLLFineMin)
            filterOut = kDFLLFineMin;

         int32_t newDCOControlVal = kDFLLFineMax - filterOut;

         gLastDCOControlVal = newDCOControlVal;

//Set DCO control value
#ifdef PHASE_LOCK_TO_USB_SOF
#if defined(__SAMD51__)
         OSCCTRL->DFLLVAL.bit.FINE = newDCOControlVal & 0xff;
#else
         //SAMD21 has 10 bit fine DCO control
         SYSCTRL->DFLLVAL.bit.FINE = newDCOControlVal & 0x3ff;
#endif
#endif
      }
      gLastFrameNumber = frameNumber;
      gLastUSBSOFTimeus = newUSBSOFTimeus;

      gPrevFrameTick = frameTick;
   }
   UDD_Handler();
}

void setup()
{
   auto irqState = saveIRQState();

//Open loop mode
#if defined(__SAMD51__)
   OSCCTRL->DFLLCTRLB.reg &= ~OSCCTRL_DFLLCTRLB_MODE;
#else
   //SAMD21
   SYSCTRL->DFLLCTRL.reg &= ~SYSCTRL_DFLLCTRL_MODE
#endif

   USB_SetHandler(&USBHandlerHook);
   restoreIRQState(irqState);

   Serial.begin(0); //baud rate is ignored
   while (!Serial)
      ;

   Serial.setTimeout(50);

   pinMode(1, OUTPUT); //Test only - toggles on eachUSB SOF
   pinMode(6, OUTPUT); //Test only - toggles on each ADC_Handler()
   pinMode(LED_BUILTIN, OUTPUT);
   digitalWrite(LED_BUILTIN, LOW);

#ifdef TIMER_OUTPUT_FOR_TEST
   /********************* Timer #3, 16 bit, one PWM out, period = 1024 */
   zt3.configure(TC_CLOCK_PRESCALER_DIV1,     // prescaler
                 TC_COUNTER_SIZE_16BIT,       // bit width of timer/counter
                 TC_WAVE_GENERATION_MATCH_PWM // frequency or PWM mode
   );
   const uint32_t kTicks = VARIANT_GCLK2_FREQ / 1000; ///1024;
   zt3.setPeriodMatch(kTicks - 1, kTicks / 4);        // channel 1 only, 200/1000 count
   if (!zt3.PWMout(true, 1, TIMER3_OUT1))
   {
      Serial.println("Failed to configure PWM output");
   }

#ifdef _VARIANT_SAMD51_THING_PLUS_
   //Sparkfun Thing Plus has different pin mapping from Adafruit Feather M4
   PORT->Group[0].PINCFG[15].reg = PORT_PINCFG_PMUXEN; //PA15
   PORT->Group[0].PMUX[7].reg &= ~(PORT_PMUX_PMUXO_Msk);
   PORT->Group[0].PMUX[7].reg |= 0x04 << 4; //   PORT_PMUX_PMUXO_E;
#endif
   //  PORT->Group[g_APinDescription[ulPin].ulPort].DIRSET.reg = (uint32_t)(1<<g_APinDescription[ulPin].ulPin) ;

   zt3.enable(true);
   /*********************************************/

#endif

   adc_setup();
   startADCTimer(gADCPointsPerSec);
}

#ifdef TIMING_CHECK
volatile int32_t gLastADCus = 0;
int32_t gLastLastADCus = 0;
#endif

volatile int gLastBit = 0;

void ADC0_1_Handler()
{
#ifdef TIMING_CHECK
   gLastADCus = micros();
#endif
   digitalWrite(6, gADCstate = !gADCstate);

   int val = ADC0->RESULT.reg;

   syncADC0_INPUTCTRL();
   int chan = ADC0->INPUTCTRL.bit.MUXPOS;

#ifdef OUTPUT_USB_SOF_PLL_SIGNALS
   if (chan - kADCStartChan == 0)
   {
      //val = gLastBit;
      //gLastBit = 1-gLastBit;
      val = gPrevFrameTick;
      if (val >= kHighSpeedTimerTicksPerUSBFrame / 2)
         val -= kHighSpeedTimerTicksPerUSBFrame;
   }
   else if (chan - kADCStartChan == 1)
   {
      val = gLastDCOControlVal; //OSCCTRL->DFLLVAL.bit.FINE;
   }
   val += 2048;
#endif

   if (!gSampleBuffers[chan - kADCStartChan].Push(val))
   {
      //digitalWrite(LED_BUILTIN, LOW); //Turn off LED to indicate overflow
   }

   if (chan == kADCStartChan && gState == kStartingSampling)
   {
      gFirstADCPointus = micros();
      gState = kHadFirstSample;
   }

