adinstruments/LightningDeviceSDK/examples/firmware/SAMD51Lightning/SAMD51Lightning.ino
   if (++chan < kADCEndChan)
   {
      ADC0->INPUTCTRL.bit.MUXPOS = chan;
      syncADC0_INPUTCTRL();

      ADC0->SWTRIG.bit.START = 1;
      syncADC0_SWTRIG();
   }
   else
   {
      ADC0->INPUTCTRL.bit.MUXPOS = kADCStartChan;
      syncADC0_INPUTCTRL();
   }

   //digitalWrite(6, gADCstate = !gADCstate );
}

class PacketBase
{
protected:
   static uint8_t sPacketCount;
};

uint8_t PacketBase::sPacketCount = 0;

class Packet : protected PacketBase
{
   //The header is 5 nibbles, i.e. "P\xA0\x40". The low nibble of the
   //3rd byte is the packet time (0x04) for data packets.
   //The head and packet type is followed by a 1 byte packet count number,
   //making a total of 4 bytes before the payload daya that need to match the
   //expected pattern(s) before the client can detect a packet.
   const char sHeader[2] = {'P', 0xA0};

public:
   static void ResetPacketCount()
   {
      sPacketCount = 0;
   }

   Packet() : mPoint(0)
   {
   }

   bool addSample(int chan, int16_t sample)
   {
      if (mPoint >= gADCPointsPerPacket)
         return false;
      //Testing!!
      //if(chan == 0)
      //   mData[mPoint][chan] = 0;
      //else
      mData[mPoint][chan] = (sample << 4) - 0x8000;

      return true;
   }

   void nextPoint()
   {
      ++mPoint;
   }

   //returns number of bytes written
   int write(Stream &stream) const
   {
      int n = stream.write(sHeader, 2);
      //Write the packet type byte (D for data, M for medium sized data packet)
      n += stream.write(uint8_t(gADCPointsPerPacket == 1 ? 'D' : 'M'));
      n += stream.write(sPacketCount++);
      n += stream.write(reinterpret_cast<const uint8_t *>(mData), sizeof(int16_t) * kADCChannels * gADCPointsPerPacket);
      return n;
   }

protected:
   int mPoint;
   int16_t mData[kPointsPerMediumSizePacket][kADCChannels];
};

class TimePacket : protected PacketBase
{
   const char sHeaderAndPacketType[3] = {'P', 0xA0, 'N'}; //'N' for now

public:
   TimePacket(int32_t tick32us, uint8_t timeRequestNumber) : mTimeRequestNumber(timeRequestNumber)
   {
      mData[0] = tick32us;
   }

   int writeData(Stream &stream) const
   {
      int n = stream.write(sPacketCount++);
      n += stream.write(mTimeRequestNumber);
      n += stream.write(reinterpret_cast<const uint8_t *>(mData), sizeof(mData));
      return n;
   }

   //returns number of bytes written
   int write(Stream &stream) const
   {
      int n = stream.write(sHeaderAndPacketType, 3);
      n += writeData(stream);
      return n;
   }

protected:
   int32_t mData[1];
   uint8_t mTimeRequestNumber;
};

class LatestUSBFrameTimePacket : protected TimePacket
{
   const char sHeaderAndPacketType[3] = {'P', 0xA0, 'L'}; //'L' for latest USB Start Of Frame time

public:
   LatestUSBFrameTimePacket(int32_t tick32us, uint8_t timeRequestNumber, uint16_t frameNumber, int32_t latestFrameus) : TimePacket(tick32us, timeRequestNumber)
   {
      mFrameNumber = frameNumber;
      mFrameTimeus = latestFrameus;
   }

   //returns number of bytes written
   int write(Stream &stream) const
   {
      int n = stream.write(sHeaderAndPacketType, 3);
      n += TimePacket::writeData(stream);
      n += stream.write(reinterpret_cast<const uint8_t *>(&mFrameNumber), sizeof(mFrameNumber));
      n += stream.write(reinterpret_cast<const uint8_t *>(&mFrameTimeus), sizeof(mFrameTimeus));
      return n;
   }

protected:
   uint16_t mFrameNumber;
   int32_t mFrameTimeus;
};

class FirstSampleTimePacket : protected PacketBase
{
   const char sHeaderAndPacketType[3] = {'P', 0xA0, 'F'}; //'F' for First sample time

public:
   FirstSampleTimePacket(int32_t tick32us)
   {
      mData[0] = tick32us;
   }

   //returns number of bytes written
   int write(Stream &stream) const
   {
      int n = stream.write(sHeaderAndPacketType, 3);
      n += stream.write(sPacketCount++);
      n += stream.write(reinterpret_cast<const uint8_t *>(mData), sizeof(mData));
      return n;
   }

protected:
   int32_t mData[1];
};

void StartSampling(int16_t startOnFrame)
{
   adcTimer.enable(false);
   NVIC_DisableIRQ(ADC0_1_IRQn);
   NVIC_ClearPendingIRQ(ADC0_1_IRQn);

   for (int chan(0); chan < kADCChannels; ++chan)
   {
      auto &buffer = gSampleBuffers[chan];
      buffer.Clear();
   }

   adc_setup();

   //Restart the ADC timer
   startADCTimer(gADCPointsPerSec);

   //digitalWrite(12, LOW); //Clear Buffer overflow
   //Packet::ResetPacketCount();
   gStartOnFrame = startOnFrame;
   gState = kWaitingForUSBSOF;

   if (gUSBLocked)
      digitalWrite(LED_BUILTIN, HIGH);
}

void StopSampling()
{
   gState = kIdle;
   gFirstSampleTimeRequested = false;

   for (int chan(0); chan < kADCChannels; ++chan)
   {
      auto buffer = gSampleBuffers[chan];
      buffer.Clear();
   }
   digitalWrite(LED_BUILTIN, LOW);
}

void sendFirstSampleTimeIfNeeded()
{
   if (!gFirstSampleTimeRequested)
      return;

   gFirstSampleTimeRequested = false;
   debugNewLine(); //Readability while testing only!

   FirstSampleTimePacket ftPacket(gFirstADCPointus);
   ftPacket.write(Serial);

   debugNewLine(); //Readability while testing only!
}

void loop()
{
#ifdef TIMING_CHECK
   int32_t delta = gLastADCus - gLastLastADCus;
   if (delta > 0)
   {
      Serial.println("  delta = " + String(delta));
      gLastLastADCus = gLastADCus;
   }
#endif

   int hasRx = Serial.peek();

   if (hasRx >= 0)
   {
      char cmdBuf[kMaxCommandLenBytes];
      int bytesRead = Serial.readBytesUntil('\n', cmdBuf, kMaxCommandLenBytes);
#ifdef ENABLE_SERIAL_DEBUGGING
      SerialUSB.println("bytesRead=" + String(bytesRead));
      SerialUSB.println(cmdBuf[0], HEX);
      SerialUSB.println(cmdBuf[1], HEX);
      SerialUSB.println();
#endif
      auto cmd = cmdBuf[0];
      switch (cmd)
      {
      case 'b': //begin sampling
      {
         int16_t startOnFrame = -1; //start on next frame
         if (bytesRead >= 4 && cmdBuf[1] == 'o')
         {
            //We assume startOnUSBFrame int16
            startOnFrame = cmdBuf[2] + (cmdBuf[3] << 8);
         }
         StartSampling(startOnFrame);
      }
      break;
      case 'f': //first sample time
         gFirstSampleTimeRequested = true;
         if (gState == kSampling)
            sendFirstSampleTimeIfNeeded();
         break;

