adinstruments/LightningDeviceSDK/examples/firmware/SAMD51Lightning/SAMD51Lightning.ino
#ifdef ENABLE_DCO_TEST_COMMANDS
      case 'D':
      {
         int coarseFreq = OSCCTRL->DFLLVAL.bit.COARSE;
         OSCCTRL->DFLLVAL.bit.COARSE = --coarseFreq;
         Serial.println("DFLL coarse =" + String(coarseFreq));
         break;
      }
      case 'I':
      {
         int coarseFreq = OSCCTRL->DFLLVAL.bit.COARSE;
         OSCCTRL->DFLLVAL.bit.COARSE = ++coarseFreq;
         Serial.println("DFLL coarse =" + String(coarseFreq));
         break;
      }
      case 'd':
      {
         int fineFreq = OSCCTRL->DFLLVAL.bit.FINE;
         OSCCTRL->DFLLVAL.bit.FINE = --fineFreq;
         Serial.println("DFLL fine =" + String(fineFreq));
         break;
      }
      case 'i':
      {
         int fineFreq = OSCCTRL->DFLLVAL.bit.FINE;
         OSCCTRL->DFLLVAL.bit.FINE = ++fineFreq;
         Serial.println("DFLL fine =" + String(fineFreq));
         break;
      }
#endif

      case 's': //stop sampling
         StopSampling();
         break;
      case 'n': //return micro second time now
      {
         int32_t now = micros();
         //uint64_t now64 = micros64();
         //digitalWrite(5, HIGH);

         auto timeRequestNumber = cmdBuf[1];
         TimePacket timePacket(now, timeRequestNumber);
         timePacket.write(Serial);

         //digitalWrite(5, LOW);

         break;
      }
      case 'u': //time of last USB SOF
      {
         auto irqState = saveIRQState(); //disable interrupts
         auto lastUSBSOFTimeus = gLastUSBSOFTimeus;
         auto lastFrameNumber = gLastFrameNumber;
         int32_t now = micros();
         restoreIRQState(irqState);

         auto timeRequestNumber = cmdBuf[1];
         LatestUSBFrameTimePacket packet(now, timeRequestNumber, lastFrameNumber, lastUSBSOFTimeus);
         packet.write(Serial);
         break;
      }
      case 'v': //version info
         //Serial.print("ArduinoRT Example V0.9.0 Channels: "+String(kADCChannels)+" $$$");
         //Send JSON version and capabilies info
         Serial.print("{");
         Serial.print("\"deviceClass\": \"Arduino_Example\",");
         Serial.print("\"deviceName\": \"SparkFun SAMD51 Thing Plus\",");
         Serial.print("\"version\": \"" + String(kFWVersion) + "\",");
         Serial.print("\"numberOfChannels\": " + String(kADCChannels) + ",");
         Serial.print("\"deviceSynchModes\": " + String(kDeviceSynchUSBFullSuppport) + ",");
         Serial.print("\"serialNumber\": \"" + String(kSerialNumber) + "\"");
         Serial.print("}$$$");

         Packet::ResetPacketCount(); //new session

#ifdef ENABLE_SERIAL_DEBUGGING
         SerialUSB.println("Sent version info");
#endif
         break;
      case '~': //sample rate
      {
         auto rateChar = cmdBuf[1]; //'0123456'
         unsigned int index = rateChar - '0';
         if (index < sizeof(kSampleRates) / sizeof(int))
            gADCPointsPerSec = kSampleRates[index];
         if (gADCPointsPerSec > 100)
            gADCPointsPerPacket = kPointsPerMediumSizePacket;
         else
            gADCPointsPerPacket = kPointsPerPacket;

         break;
      }
      default:
         break;
      }
   }

   if (gState == kIdle)
      return;

   if (gState == kHadFirstSample)
   {
      gState = kSampling;
      sendFirstSampleTimeIfNeeded();
   }

   //Find the number of samples in the ringbuffer with the least samples
   int points = gSampleBuffers[0].GetCount();
   for (int chan(1); chan < kADCChannels; ++chan)
   {
      auto &buffer = gSampleBuffers[chan];
      points = min(buffer.GetCount(), points);
   }

   while (points >= gADCPointsPerPacket)
   {
      Packet packet;

      for (int pt(0); pt < gADCPointsPerPacket; ++pt)
      {
         for (int chan(0); chan < kADCChannels; ++chan)
         {
            auto &buffer = gSampleBuffers[chan];
            packet.addSample(chan, buffer.GetNext());
         }
         packet.nextPoint();
      }

      //digitalWrite(7, HIGH);
      packet.write(Serial);
      //digitalWrite(7, LOW);

      --points;

      //debugNewLine();   //Readability while testing only!
   }

} //loop